#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3581290c-b8db-43cf-8200-7a2e7a181f13]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_openid_client.this: Refreshing state... [id=d9ea1689-ab66-4bdd-82d6-19e31007b2b5]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=28c2b610-f326-4432-a070-d6a53a73e545]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=614c4c6e-6791-4223-bf67-7e3c5c2c5fad]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c1a3b516-1e66-4387-bfcb-be6146cd4df0]
module.keycloak_dev.module.onestopauth.module.client_aug-18-744-pm-695.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=06a1f71b-7f6c-41e1-bda8-730e1e66bd2a]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=dbfcfc06-816a-44e9-9729-bbb0dcbd3ac5]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=747dd4c8-c0a7-48cd-bcd4-d41e6f80e63e]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=b736fc9f-a588-487c-a8d5-f9fedd1cf89f]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=a1624ea6-ba03-4982-b59d-0f20423d7ed4]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=9ff96311-ac47-4bbe-a054-71ab6f55c023]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=aa1c86d7-f8aa-4714-9926-a58622d1d324]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8f9958b3-f40b-48ae-815e-0fc0271b345b]
module.keycloak_dev.module.onestopauth.module.client_zz-2873.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2feb5617-2be9-483d-8ec0-04ecc6deff3f]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=f2e01476-5a7e-4cb4-8be0-dc8d72a632e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=0ef0c67a-a3c8-43ee-b063-94aee9369cfb]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e28c54bd-bc2c-45e8-8989-ce583c6cc4c9]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ff3a9ce1-8b55-4d29-a4d7-4f5060983d20]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=55535ce7-35e1-41ed-a676-c4bd95901b73]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=f79608b6-c48a-4aef-8034-89d768bc481e]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=611eb206-5f42-444d-99f8-0e67d30e66e5]
module.keycloak_dev.module.onestopauth.module.client_testprojectjunmin-2222-34.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d51f3680-5a56-42fa-ab7a-1ce46dd41233]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=4483b045-0799-46b0-b2c1-20d013de7355]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=58c65833-079e-47e3-ab84-0d052e2746be]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=93cfbdb4-53f9-451e-99d3-db90f8b0b0ed]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=7790a96d-8885-4ce0-9ec3-e4f97b16d32a]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=1445a013-c23c-467f-8264-28a36387e9c6]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=2b0a92d5-c80d-405d-806d-395d38edf809]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=6eb92938-6586-40ca-8068-d853ffeca3db]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f98f3160-11ea-4771-a101-a31f444f2a5d]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=4a186eaa-3b50-4992-99b7-4bd27feddd6c]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=81554737-88fe-45dd-8325-86d9653a0cc4]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=a492ac28-fa52-4d5f-9505-8b1f100a4dda]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=3928016b-9993-4ae4-8f5a-f2c988710f6b]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=157c5fc1-4957-4134-855a-e94e8d60f2d8]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=0c00d13e-5c61-40f0-b66a-ea4a9b8abfac]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=c3279360-aa3b-4d63-a344-91548ab81aa0]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=f134767a-bca2-43ca-9759-1c3c3ab11331]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=0e7da164-2acd-4903-a7b4-56d4741a6036]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=edb9b7eb-a870-42b6-8fcb-ce214e846d92]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c03015ab-3612-4e49-8129-1d9036d99cf4]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=9324b99a-fbf3-473d-b34d-e56d786848aa]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=bbef5ee2-09af-4e7d-97f1-1284679cce4b]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=c74a0031-aabb-4557-9292-c88af0fa9605]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=b6e462a4-feee-4cd9-bf22-c66c32d86811]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ed0f60bd-8986-425a-a7d6-c81d2b82966c]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=dab3edc5-9e20-4338-9570-e2e4857dfbae]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=d463262b-4b9a-4aa2-bace-6b58abea7093]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=5f2e7cb5-4203-45e8-97bf-26e62a071753]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=306160cd-a478-4c56-b164-e4c00fd957f3]
module.keycloak_dev.module.onestopauth.module.client_test-7-28-2021-133.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=ea90df44-6f29-4da4-b3f0-b7cf51b2f87d]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=a2925fcf-162c-4b59-bdf5-a84b0686f70f]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=6a455955-558a-4a9b-b4f9-244792055a25]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=ec1e3c7c-ee70-41ae-88df-fa012dd9a06a]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=d0511de3-2abf-4a75-a182-5f0659fc03f7]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=76ed71b4-542f-4e28-8711-8d33edfc8ef6]
module.keycloak_dev.module.onestopauth.module.client_test-1520.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=db3a8cb2-016e-40b7-a905-5e274f606e96]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=f1ca2c8f-9b82-4912-a92e-dcf363b8623b]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=c0d6e389-c17c-4c6d-b1a2-4cf9d6049c6a]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=63344caa-d4b5-49f9-8da2-b3e04c3843d0]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=d78b6009-272c-4300-8c40-aed74d3d3eeb]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=51f4c792-44ac-4cf6-9d71-6f5e95fa7bbb]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=624232c4-9a34-4c83-b103-21fddc209e2a]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=a5152ade-230c-45b8-827c-ff12b3622924]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=bb19b5dc-0b4a-4d5d-aeba-faca6f18c0f2]
module.keycloak_dev.module.onestopauth.module.client_test-994.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=8a263f36-6a9e-4354-b081-a65307b6f5d4]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c31fd301-394d-4828-bd45-ec0751004103]
module.keycloak_dev.module.onestopauth.module.client_test-2-aug-19-728.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=57933b07-9c45-4129-b9f0-46f1d910e1c8]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=04c90f04-4224-4962-bd11-9e9ba98dafc5]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=2713135b-243f-481e-97be-640c34b23892]
module.keycloak_dev.module.onestopauth.module.client_test-project-2-664.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=c1463e80-9214-4c5d-8a03-bda5a5828681]
module.keycloak_dev.module.onestopauth.module.client_cypress-test-2115.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=60e6e804-7523-4264-b7d2-72ea7daaba22]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=242f559a-5b9f-4351-abda-4aa1cd1ea96f]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=a486276e-2359-42aa-b7f5-624e9bbdaaac]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=656ea0c6-04d0-4953-a670-9482828b9b56]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=7f36873e-e532-4665-adfb-e67bef1bdfdd]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=d5471293-c661-4e0b-a6f7-5520712c4392]
module.keycloak_dev.module.onestopauth.module.client_test-69.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=b7c4055c-8f66-459f-94e4-cf51b597c772]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=45578e11-c4be-4421-b4bf-1d0d52198a0d]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=376b14e1-332d-473f-87d2-6840780376e6]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=e12b99a3-70bb-45cc-934a-353bbe2a2621]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=3d76c8e8-1cc6-4ba3-8bc1-f10b2a0ddcb1]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=e667cf59-6571-4ade-801b-e982726167b8]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=cd8fc724-320f-454f-b84a-b80913bca910]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=c05ff3c3-9d3c-4f63-9749-734267a00def]
module.keycloak_test.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=f8f53305-a0bd-4217-8f99-f01f7ac449e9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=8c6e98fe-75a4-42a7-bf1b-c3d7e579dd0b]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=f345e9f1-be87-4b71-ae6f-d9e55be698f9]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=44c24238-10b4-4d9a-b971-bfbaf3a57f49]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=ab096687-352c-4eb7-8ff1-c49daccf7988]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_guid_mapper: Refreshing state... [id=300c4fbf-1228-4968-be76-d27a38079105]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.client_roles_mapper: Refreshing state... [id=65845072-a61d-4c8a-bdb3-824835aebac7]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=8fbaa254-7423-4ae2-8755-661e88b7030c]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=7735369f-97b6-40d1-b9d7-d11e2d5e8264]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=2a9d4f7d-00f2-4a2f-8cb4-d5cc120a8a1b]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.access_token_aud: Refreshing state... [id=5c4cac7f-0510-496d-94c4-3c6ca11818e7]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper: Refreshing state... [id=e0265be7-394d-45e0-a698-891db72ef1c7]
module.keycloak_prod.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=afe980db-1143-4496-95e6-6af762624016]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.identity_provider_mapper: Refreshing state... [id=47c85585-5ec7-4691-970f-f6fe3f91ebd6]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_userid_mapper: Refreshing state... [id=e2bed365-e3e7-4541-a4b8-f1dd45835965]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.idir_userid_mapper: Refreshing state... [id=aad22f8b-0eac-4152-b0fd-bc50210be416]
module.keycloak_dev.module.onestopauth.module.client_aet-1981.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper: Refreshing state... [id=cd58f131-d1c6-42b8-a4aa-6121783968a5]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.onestopauth.module.client_feb-2-test-team-access-to-json-4918.keycloak_openid_client.this has been changed
  ~ resource "keycloak_openid_client" "this" {
        id                                       = "3b8a90dc-f5bd-4a7f-a5cb-56a881a685ba"
        name                                     = "feb-2-test-team-access-to-json-4918"
      + web_origins                              = []
        # (14 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "feb-3-test-team-access-to-files-4951"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth"
    }

  # module.keycloak_dev.module.onestopauth.module.client_feb-3-test-team-access-to-files-4951.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "PUBLIC"
      + client_id                                = "feb-3-test-team-access-to-files-4951"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "feb-3-test-team-access-to-files-4951"
      + pkce_code_challenge_method               = "S256"
      + realm_id                                 = "onestopauth"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://www.test.ca",
        ]
      + web_origins                              = [
          + "+",
          + "http://www.test.ca",
        ]
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.access_token_aud will be created
  + resource "keycloak_generic_client_protocol_mapper" "access_token_aud" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"       = "true"
          + "id.token.claim"           = "false"
          + "included.client.audience" = "first-project-3"
        }
      + id              = (known after apply)
      + name            = "access_token_aud"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-audience-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.bceid_business_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.bceid_business_name_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_business_name_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_business_name"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_business_name"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_business_name"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.bceid_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "bceid_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "bceid_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "bceid_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "bceid_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.client_roles_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "client_roles_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"                   = "true"
          + "claim.name"                           = "client_roles"
          + "id.token.claim"                       = "true"
          + "jsonType.label"                       = "String"
          + "multivalued"                          = "true"
          + "userinfo.token.claim"                 = "true"
          + "usermodel.clientRoleMapping.clientId" = "first-project-3"
        }
      + id              = (known after apply)
      + name            = "client_roles"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-client-role-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.identity_provider_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "identity_provider_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"         = "true"
          + "access.tokenResponse.claim" = "false"
          + "claim.name"                 = "identity_provider"
          + "id.token.claim"             = "true"
          + "jsonType.label"             = "String"
          + "user.session.note"          = "identity_provider"
        }
      + id              = (known after apply)
      + name            = "IDP"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usersessionmodel-note-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.idir_guid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_guid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_guid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_guid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_guid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_generic_client_protocol_mapper.idir_userid_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "idir_userid_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "access.token.claim"   = "true"
          + "claim.name"           = "idir_userid"
          + "id.token.claim"       = "true"
          + "jsonType.label"       = "String"
          + "user.attribute"       = "idir_userid"
          + "userinfo.token.claim" = "true"
        }
      + id              = (known after apply)
      + name            = "idir_userid"
      + protocol        = "openid-connect"
      + protocol_mapper = "oidc-usermodel-attribute-mapper"
      + realm_id        = "onestopauth-basic"
    }

  # module.keycloak_dev.module.onestopauth_basic.module.client_first-project-3.keycloak_openid_client.this will be created
  + resource "keycloak_openid_client" "this" {
      + access_type                              = "CONFIDENTIAL"
      + client_id                                = "first-project-3"
      + client_secret                            = (sensitive value)
      + consent_required                         = false
      + description                              = "CSS App Created"
      + direct_access_grants_enabled             = false
      + enabled                                  = true
      + exclude_session_state_from_auth_response = false
      + full_scope_allowed                       = false
      + id                                       = (known after apply)
      + implicit_flow_enabled                    = false
      + name                                     = "first-project-3"
      + realm_id                                 = "onestopauth-basic"
      + resource_server_id                       = (known after apply)
      + service_account_user_id                  = (known after apply)
      + service_accounts_enabled                 = false
      + standard_flow_enabled                    = true
      + valid_redirect_uris                      = [
          + "http://localhost:3000",
        ]
    }

Plan: 18 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_aws_account_id"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "target_env" but a value
│ was found in file "/terraform/terraform.tfvars". If you meant to use this
│ value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 3456 estimated
           $0.0/mo +$0.0
```

</details>

*Pusher: @junmin-bcgov, Action: `pull_request`*